# Getting and Knowing Data

In [283]:
import pandas as pd
import numpy as np

## Step 1: Import Dataset

In [284]:
df = pd.read_csv("chipotle.tsv", sep = "\t")

In [285]:
# Return the first N lines
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## Step 2: Dataset Overview

In [286]:
# Return a tuple (The number of rows, The numbers of column)
df.shape

(4622, 5)

In [287]:
# Retun the column details
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [288]:
# Print all column name
list(df.columns)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [289]:
# Index of rows
df.index

RangeIndex(start=0, stop=4622, step=1)

In [290]:
# Giá trị trung bình (mean), độ lệch chuẩn (std), giá trị nhỏ nhất (min), giá trị lớn nhất (max), các phân vị (percentiles) như 25%, 50%, 75%
# Độ lệch chuẩn (Standard Deviation) là một chỉ số thống kê đo lường mức độ phân tán hoặc biến động của dữ liệu so với giá trị trung bình (mean).
# Phân vị 25% (Q1): Là giá trị dưới đó có 25% dữ liệu. Nói cách khác, 25% các giá trị trong tập dữ liệu nằm dưới giá trị này.
# df.describe()
df.describe(include="all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

### loc vs iloc (Location vs Index Location)

In [291]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [292]:
df.loc[(df.quantity >= 2) & (df.item_name == "Nantucket Nectar"), ['order_id', 'quantity', 'item_name']]

      order_id  quantity         item_name
601        247         2  Nantucket Nectar
2379       947         2  Nantucket Nectar

In [293]:
df.iloc[[9]]

,order_id,quantity,item_name,choice_description,item_price
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [294]:
df.iloc[3:11]

,order_id,quantity,item_name,choice_description,item_price
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
10,5,1,Chips and Guacamole,NaN,$4.45

In [295]:
x = df.iloc[3:5, :-1]
y = df.iloc[3:5, -1]
print(y)

3     $2.39
4    $16.98
Name: item_price, dtype: object

### Data manipulation: Thao tác với dữ liệu

In [296]:
df.item_price.dtype

dtype('O')

#### Apply()

In [297]:
df.item_price = df.item_price.apply(lambda x : float(x.replace('$', '')))

In [298]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [299]:
df.item_price.dtype

dtype('float64')

In [300]:
# Create a new column
df["total_price"] = df["quantity"] * df["item_price"] # Must to use same format

In [301]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

#### How much was the revenue for the period in the dataset

In [302]:
revenue = df.total_price.sum()
print("Total Revenue: " + str(revenue) + "$")

Total Revenue: 39237.02$

#### Which was the most-ordered item?

#### Group By

In [307]:
c = df.groupby("item_name")["quantity"].sum()
c.sort_values(ascending = False).head(5)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

In [304]:
# Unique Value
df.item_name.value_counts().count()

50

In [305]:
df.item_name.nunique()

50